#Пользователь вводит Имя, Возраст и Город, сформировать приветственное сообщение путем форматирования 3-мя способами
name = input('Введите Ваше имя')
age = input('Введите Ваш возраст')
city = input('Введите Ваш город')
print(f'Добро пожаловать {name}. Вам {age} лет. {city} красивый город. ')
print('Добро пожаловать %(name)s. Вам %(age)s лет. %(city)s красивый город')
print('Добро пожаловать %s . Вам %s лет. %s красивый город.' %(name, age, city))
print('Добро пожаловать {name}. Вам {age} лет. {city} красивый город').format(name, age,city)